Repository: Dzejkoubi/skapka
Catalog: skapka_app/lib/app/l10n/app_*.arb
Languages: cs

# language
source: English
cs: Čeština

# navbar_dependents
source: Dependents
cs: Osoby

# navbar_events
source: Events
cs: Výpravy

# navbar_calendar
source: Calendar
cs: Kalendář

# navbar_info
source: Information
cs: Informace

# welcome_screen_title
source: Welcome to Skapka 👋
cs: Vítej ve Skapce

# welcome_screen_login_button_text
source: Log in
cs: Přihlásit se

# welcome_screen_register_button_text
source: Register
cs: Registrovat se

# welcome_screen_songbook_button_text
source: Songbook
cs: Zpěvník

# login_screen_title
source: Login
cs: Přihlášení

# login_screen_email_hint
source: Email address
cs: E-mail

# login_screen_password_hint
source: Password
cs: Heslo

# login_screen_forgot_password_text
source: Forgot password?
cs: Zapomněl si heslo?

# login_screen_login_button_text
source: Log in
cs: Přihlásit se

# login_screen_login_error_password_empty
source: Did you forget your password?
cs: Nezapomeň na heslo.

# login_screen_login_error_password_too_short
source: Password must be at least 8 characters.
cs: Heslo musí mít alespoň 8 znaků.

# login_screen_login_error_invalid_credentials
source: Invalid login credentials.
cs: Neplatné přihlašovací údaje.

# login_screen_login_error_email_not_confirmed
source: Email address is not confirmed. Please check your inbox.
cs: E-mailová adresa není potvrzena. Zkontroluj prosím svou schránku.

# login_screen_login_error_email_empty
source: Did you forget your email?
cs: Nezapomněl/a si na email?

# login_screen_login_error_email_invalid
source: Oops, that doesn't look like a valid email.
cs: Pozor, takhle přece nevypadá e-mail.

# login_screen_login_success
source: Login successful! 🎉
cs: Přihlášení proběhlo úspěšně!

# login_screen_login_error_generic
source: Something went wrong. Please try again.
cs: Něco se nepovedlo. Zkus to prosím znovu.

# register_screen_title
source: Register
cs: Registrace

# register_screen_1_name_hint
source: Name
cs: Jméno

# register_screen_1_surname_hint
source: Surname
cs: Příjmení

# register_screen_1_email_hint
source: Email address
cs: E-mail

# register_screen_1_next_button_text
source: Next
cs: Další

# register_screen_1_error_invalid_name
source: Name can only contain letters and hyphens.
cs: Jméno může obsahovat jen písmena a pomlčky.

# register_screen_1_error_empty_name
source: Don't you have a name?
cs: Nemáš snad jméno?

# register_screen_1_error_invalid_surname
source: Surname can only contain letters and hyphens.
cs: Příjmení může obsahovat jen písmena a pomlčky.

# register_screen_1_error_empty_surname
source: What about your surname?
cs: A co příjmení?

# register_screen_1_error_email_empty
source: Did you forget your email?
cs: Nezapomněl/a si na email?

# register_screen_1_error_email_invalid
source: Oops, that doesn't look like a valid email.
cs: Pozor, takhle přece nevypadá e-mail.

# register_screen_2_password_hint
source: Password
cs: Heslo

# register_screen_2_confirm_password_hint
source: Confirm password
cs: Potvrď heslo

# register_screen_2_register_button_text
source: Register
cs: Registrovat

# register_screen_2_error_passwords_do_not_match
source: Passwords do not match.
cs: Hesla se neshodují.

# register_screen_2_registration_success
source: Registration successful! 🎊
cs: Registrace proběhla úspěšně!

# register_screen_2_registration_error_email_used
source: This email is already in use. Try logging in or use a different email.
cs: Tento e-mail je již použit. Zkus se přihlásit nebo použij jiný e-mail.

# register_screen_2_registration_error_rate_limit
source: Too many attempts. Please try again later.
cs: Příliš mnoho pokusů. Zkus to prosím později.

# register_screen_2_registration_error_weak_password
source: Password is too weak.
cs: Heslo je příliš slabé.

# register_screen_2_registration_error_generic
source: Registration failed. Please try again.
cs: Registrace se nezdařila. Zkus to prosím znovu.

# account_not_approved_screen_title
source: Account not yet approved
cs: Účet ještě nebyl schválen

# account_not_approved_screen_text
source: An administrator must approve your account{name_surname}before you can log in. Once they do, you will receive an email.
cs: Administrátor musí tvůj účet{name_surname}nejdřív schválit, než se budeš moct přihlásit. Jakmile to udělá, přijde ti e-mail.

# account_not_approved_screen_notify_administrator_button_text
source: Notify administrator
cs: Upozornit administrátora

# account_not_approved_screen_notify_administrator_dialog_title
source: Notify administrator
cs: Upozornit administrátora

# account_not_approved_screen_notify_administrator_dialog_description
source: This step will notify the administrator by email. It can be sent once a day.
cs: Tento krok upozorní administrátora emailem. Lze poslat jednou za den.

# account_not_approved_screen_notify_administrator_dialog_primary_button_text
source: Send notification
cs: Poslat upozornění

# account_not_approved_screen_notify_administrator_button_error_dialog
source: Notifications can only be sent once every 24 hours. Please try again later.
cs: Upozornění lze poslat jen jednou za 24 hodin. Zkus to později.

# account_not_approved_screen_notify_success
source: Administrator has been notified. 📧
cs: Administrátor byl upozorněn.

# account_not_approved_screen_notify_error
source: Failed to notify administrator. Please try again later.
cs: Nepodařilo se upozornit administrátora. Zkus to prosím později.

# account_not_approved_screen_logout_button_text
source: Log out
cs: Odhlásit se

# account_not_approved_screen_logout_dialog_title
source: Log out
cs: Odhlásit se

# account_not_approved_screen_logout_dialog_description
source: Are you sure you want to log out of your account?
cs: Opravdu se chceš odhlásit ze svého účtu?

# account_not_approved_screen_logout_dialog_primary_button_text
source: Log out
cs: Odhlásit se

# account_not_approved_screen_logout_success
source: Logged out successfully.
cs: Odhlášení proběhlo úspěšně.

# account_not_approved_screen_logout_error
source: Failed to log out. Please try again.
cs: Odhlášení se nezdařilo. Zkus to prosím znovu.

# account_not_approved_screen_delete_account_button_text
source: Delete account
cs: Smazat účet

# account_not_approved_screen_delete_account_dialog_title
source: Delete account
cs: Smazat účet

# account_not_approved_screen_delete_account_dialog_description
source: Are you sure you want to delete your account? This action cannot be undone.
cs: Opravdu chceš smazat svůj účet? Tuto akci nelze vrátit zpět.

# account_not_approved_screen_delete_account_dialog_primary_button_text
source: Delete account
cs: Smazat účet

# account_not_approved_screen_delete_success
source: Your account has been deleted. 👋
cs: Tvůj účet byl smazán.

# account_not_approved_screen_delete_error
source: Failed to delete account. Please try again later.
cs: Smazání účtu se nezdařilo. Zkus to prosím později.

# events_screen_title
source: Events
cs: Výpravy

# events_screen_no_events_text
source: {username} currently has no active events.
cs: {username} aktuálně nemá žádnou aktivní výpravu.

# event_box_number_of_kids_text
source: {number_of_kids} kids
cs: {number_of_kids} dětí

# event_box_photos_link_text
source: Photos
cs: Fotky

# event_box_sign_up_start_date_text
source: Sign-up starts on:
cs: Přihlašování od:

# event_box_sign_up_end_date_text
source: Sign-up ends on:
cs: Přihlašování do:

# event_box_event_multiple_days_start_text
source: Meeting time:
cs: Od:

# event_box_event_multiple_days_end_text
source: Leaving time:
cs: Do:

# event_box_event_single_day_text
source: Meet-End:
cs: Kdy:

# calendar_screen_title
source: Calendar
cs: Kalendář

# calendar_screen_speed_dial_add_google_calendar
source: Google Calendar
cs: Google kalendář

# calendar_screen_event_expansion_tile_future_title
source: Upcoming
cs: Nadcházející

# calendar_screen_event_expansion_tile_future_no_events_subtitle
source: It seems there are no upcoming events.
cs: Zdá se, že nejsou žádné nadcházející výpravy.

# calendar_screen_event_expansion_tile_live_title
source: Current
cs: Přihlašování

# calendar_screen_event_expansion_tile_live_no_events_subtitle
source: It seems there are no current events.
cs: Zdá se, že nejsou žádné výpravy k přihlášení.

# calendar_screen_event_expansion_tile_past_title
source: Past
cs: Proběhlé

# calendar_screen_event_expansion_tile_past_no_events_subtitle
source: It seems there are no past events.
cs: Zdá se, že nejsou žádné proběhlé výpravy.

# calendar_screen_event_expansion_tile_draft_title
source: Drafts
cs: Koncepty

# calendar_screen_event_expansion_tile_draft_no_events_subtitle
source: It seems there are no draft events.
cs: Zdá se, že nejsou žádné koncepty.

# create_edit_event_screen_title_create
source: Create event
cs: Vytvořit výpravu

# create_edit_event_screen_title_edit
source: Edit event
cs: Upravit výpravu

# create_edit_event_screen_save_event_dialog_title
source: Save as Draft
cs: Uložit jako koncept

# create_edit_event_screen_save_event_dialog_description
source: Do you want to save this event as a draft? The event will be published only after clicking the publish button. You can edit it later.
cs: Chceš uložit tuto výpravu jako koncept? Výprava se zveřejní až po kliknutí na tlačítko zveřejnit. Můžeš ji upravit později.

# create_edit_event_screen_save_event_dialog_primary_button_text
source: Save as Draft
cs: Uložit jako koncept

# create_edit_event_screen_save_changes_dialog_title
source: Save Changes
cs: Uložit změny

# create_edit_event_screen_save_changes_dialog_description
source: Are you sure you want to save changes to this event?
cs: Opravdu chceš uložit změny v této výpravě?

# create_edit_event_screen_speed_dial_publish_event_text
source: Publish
cs: Zveřejnit

# create_edit_event_screen_publish_event_dialog_title
source: Publish Event
cs: Zveřejnit výpravu

# create_edit_event_screen_publish_event_dialog_description
source: Are you sure you want to publish this event? It will be visible to all participants.
cs: Opravdu chceš zveřejnit tuto výpravu? Výprava se přidá do kalendáře a až nadejde čas přihlašování, budou se moct pozvaní účastníci přihlašovat.

# create_edit_event_screen_publish_event_dialog_primary_button_text
source: Publish
cs: Zveřejnit

# create_edit_event_screen_speed_dial_unpublish_event_text
source: Unpublish
cs: Zrušit zveřejnění

# create_edit_event_screen_unpublish_event_dialog_title
source: Unpublish Event
cs: Zrušit zveřejnění výpravy

# create_edit_event_screen_unpublish_event_dialog_description
source: Are you sure you want to unpublish this event? It will be hidden from all participants.
cs: Opravdu chceš zrušit zveřejnění této výpravy? Účastníci se nebudou moct dál přihlašovat a výprava se odstraní z kalendáře.

# create_edit_event_screen_unpublish_event_dialog_primary_button_text
source: Unpublish
cs: Zrušit zveřejnění

# create_edit_event_screen_speed_dial_delete_event_text
source: Delete Event
cs: Smazat

# create_edit_event_screen_delete_event_dialog_title
source: Delete Event
cs: Smazat výpravu

# create_edit_event_screen_delete_event_dialog_description
source: Are you sure you want to delete this event? This action cannot be undone.
cs: Opravdu chceš smazat tuto výpravu? Tuto akci nelze vrátit zpět.

# create_edit_event_screen_delete_event_dialog_primary_button_text
source: Delete
cs: Smazat

# create_edit_event_screen_go_back_without_saving_dialog_title
source: Discard Changes
cs: Zahodit změny

# create_edit_event_screen_go_back_without_saving_dialog_description
source: Are you sure you want to go back without saving changes? All unsaved changes will be lost.
cs: Opravdu chceš odejít bez uložení změn? Veškeré neuložené změny budou ztraceny.

# create_edit_event_screen_go_back_without_saving_dialog_primary_button_text
source: Discard
cs: Zahodit

# create_edit_event_screen_event_title_hint
source: Event Title
cs: Název výpravy

# create_edit_event_screen_event_title_error_empty
source: Event title cannot be empty.
cs: Název výpravy nemůže být prázdný.

# create_edit_event_screen_event_title_error_too_long
source: Event title cannot exceed 50 characters.
cs: Název výpravy nemůže přesáhnout 50 znaků.

# create_edit_event_screen_event_sign_up_from
source: Sign-up from
cs: Přihlašování od

# create_edit_event_screen_event_sign_up_to
source: Sign-up to
cs: Přihlašování do

# create_edit_event_screen_event_from_hint
source: Meeting Time:
cs: Od

# create_edit_event_screen_event_to_hint
source: Leaving Time:
cs: Do

# create_edit_event_screen_select_participants_text
source: Select Participants
cs: Vybrat účastníky

# create_edit_participants_screen_title
source: Select Participants
cs: Vybrat účastníky

# create_edit_participants_screen_leaders
source: Leaders
cs: Vedoucí

# create_edit_participants_screen_kids
source: Kids
cs: Děti

# create_edit_participants_screen_select_all
source: Select All
cs: Vybrat všechny

# create_edit_participants_screen_dial_print
source: Print List
cs: Vytisknout seznam

# create_edit_participants_screen_dial_limit
source: Participant Limit
cs: Limit účastníků

# create_edit_event_screen_total_participants_text
source: Invited Participants
cs: Celkový počet účastníků

# create_edit_event_screen_total_signed_up_participants_text
source: Signed Up Participants
cs: Celkový počet přihlášených

# create_edit_event_screen_troops
source: Troops
cs: Družinky

# create_edit_event_screen_instructions_text
source: Instructions
cs: Pokyny

# create_edit_instructions_screen_title
source: Event Instructions
cs: Pokyny výpravy

# create_edit_event_screen_meeting_place_text
source: Meeting place
cs: Místo srazu

# create_edit_event_screen_photo_album_link_text
source: Photo Album Link
cs: Odkaz na fotoalbum

# create_edit_event_screen_photo_album_link_description
source: Link to the shared photo album from the event. If you do not fill it in, the photo album link will not be displayed.
cs: Odkaz na sdílenené fotoalbum z výpravy. Pokud nevyplníš, odkaz na fotoalbum nebude zobrazen.

# settings_screen_title
source: Settings
cs: Nastavení

# settings_screen_change_signout_button_text
source: Sign Out
cs: Odhlásit se

# settings_screen_change_delete_account_button_text
source: Delete Account
cs: Smazat účet

source: Yes
cs: Ano

source: No
cs: Ne

source: Cancel
cs: Zrušit

source: Loading...
cs: Načítání...

source: Back
cs: Zpět

# common_copied_to_clipboard
source: Copied to clipboard 📋
cs: Zkopírováno do schránky

source: Create
cs: Vytvořit

source: Edit
cs: Upravit

source: Save
cs: Uložit
